'use strict'

//Мінімум

//1 Створи HTML-файл, в ньому пропиши всі можливі способи використання JS;

//написав в html


//2 Тобі потрібно зберігати ім’я та прізвище в змінній, придумай до 4-х імен змінних, що потрібні тобі для даної задачі. 
//Також напиши до 5 неправильних імен (неправильні імена повинні бути закоментовані);

let firstNameV1;
let firstNameV2;
let lastNameV1;
let lastNameV2;

// let 1vfirsname;
// let 2vlastname;
// let const;
// let abcd;
// let zMinNa;

//3 Вкажи всі можливі способи коментування коду;

//

/*
*/

/**
 * 
 * 
 */

//4 Які стилі написання імен змінних ти знаєш?

// lowerCamelCase  - всі з великої букви окрім першого
// CamelCase - всі з великої букви
// snake_case - розділення слів нижнім підкресленням




// Норма

// Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;

let firstName = prompt("What is your name?");
console.log("Привіт " + firstName);

// Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;

const THIS_YEAR = 2022;
let age = prompt("Введіть рік вашого народження");
console.log(THIS_YEAR - age);

// Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата

let length = prompt("Яка довжина сторони квадрату?");
console.log(length * 4);


// Максимум

// Запитай у користувача радіус кола і виведи площу такої окружності.

let radius = prompt("Який радіус кола?");
const PI = 3.14;
let area = radius * radius * PI;
console.log(area);

// Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.

let distance = prompt("Яка відстань між містами в кілометрах? Наприклад:", "100");
let time = prompt("За який час плануєте дістатись кінцевої точки в годинах? Наприклад:", "3");
let speed = ~~(distance / time);
console.log(" Вам потрібно рухатись зі швидкістю " + speed + "/год.");

// Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.

const USD = 40.5;
const EUR = 45;
let exchange = prompt("Яку суму ви хотіли б внести? Наприклад:", "100") * USD / EUR;
console.log(exchange);
